app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.tasks.any? %>
---
SELECT  1 AS one FROM "tasks" WHERE "tasks"."user_id" = ? LIMIT 1  [["user_id", 1]]