app/controllers/tasks_controller.rb

  def tasks
    if logged_in?
      @task = current_user.tasks.build
      @importantTasksfeed_items = current_user.importantTasksfeed.paginate(page: params[:page])
---
SELECT  "tasks".* FROM "tasks" WHERE (user_id = 1)  ORDER BY "tasks"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]

  def create
    @task = current_user.tasks.build(task_params)
    if @task.save
---
INSERT INTO "tasks" ("importantTasks", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["importantTasks", "Hello"], ["user_id", 1], ["created_at", "2016-04-28 17:43:09.432083"], ["updated_at", "2016-04-28 17:43:09.432083"]]