app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @tasks = @user.tasks.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  ORDER BY "tasks"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["password_digest", "$2a$04$zSrDGoHu6EGg0MJyIVzaEOKxnbYnqKal0iK96qAOoEnUNdQbIsoUm"], ["updated_at", "2016-04-14 17:21:50.165358"], ["id", 762146111]]